#include <stdio.h>
#include <math.h>
int main() {
	// Обьявление переменной
	int a = 1;


	// Модуль 1. Занятие 2.
	// Операторы ввода/вывода.
	// Для их использования необходимо прописать
	//   #include <stdio.h> как в 1 строке этого файла.
	// 
	// Оператор вывода в C:
	printf("Hello, World!");
	//
	// Для перевода на новую строку используется "\n".
	printf("Hello, World!\n");
	//
	// Для вывода int нужно в строке прописать %d, 
	//   а в аргументах передать значения.
	printf("a=%d\n", a);
	// Для ввода информации должен использоваться указатель
	//          ↓
	scanf("%d\n", &a;);


	// Модуль 1. Занятие 3.
	// Оператор ветвления в неполной форме
	// Он выглядит так:
	if (a == 1) {
		printf("Оператор ветвления в неполной форме.\n");
	}
	//
	// Условие пишется в скобках
	// ↓      ↓
	if (a == 1) {
		printf("Оператор ветвления в неполной форме.\n");
	}
	//
	// В фигурных скобках расположены операторы, 
	//   которые должны выполниться если условие верно.


	// Модуль 1. Занятие 4.
	// Оператор ветвления в полной форме
	// Все то же самое, но с else.
	if (a == 1) {
		printf("1 случай.\n");
	}
	else {
		printf("2 случай.\n");
	}
	// Если оператор один, можно короче:
	if (a == 1) printf("1 случай кратко.\n");
	else printf("2 случай кратко.\n");


	// Модуль 1. Занятие 5.
	// Вложенный оператор ветвления
	if (a == 1) {
		if (a>0) {
			printf("Хоба, цыганские фокусы.\n");
		}
	}


	//
}