#include <stdio.h>
#include <math.h>
int main() {
	// Обьявление переменной
	int a = 1;


	// Модуль 1. Занятие 2.
	// Операторы ввода/вывода.
	// Для их использования необходимо прописать
	//   #include <stdio.h> как в 1 строке этого файла.
	// 
	// Оператор вывода в C:
	printf("Hello, World!");
	//
	// Для перевода на новую строку используется "\n".
	printf("Hello, World!\n");
	//
	// Для вывода int нужно в строке прописать %d, 
	//   а в аргументах передать значения.
	printf("a=%d", a);
	// Для ввода информации должен использоваться указатель
	//          ↓
	scanf("%d", &a;);


	// Модуль 1. Занятие 3.
	// Оператор ветвления в неполной форме
	// Он выглядит так:
	if (a == 1) {
		printf("Оператор ветвления в неполной форме.");
	}
	//
	// Условие пишется в скобках
	// ↓      ↓
	if (a == 1) {
		printf("Оператор ветвления в неполной форме.");
	}
	//
	// В фигурных скобках расположены операторы, 
	//   которые должны выполниться если условие верно.
}